def area(a, b):
    '''
    Возращает площадь прямоугольника.
    Параметры :
        a (int) : значение длины одной пары сторон прямоугольника.
        b (int) : значение длины второй пары сторон прямоугольника.

    Возваращаемое значение :
        area (int) : площадь квадрата со сторонами a и b.
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.
    Параметры :
        a (int) : значение длины одной пары сторон прямоугольника.
        b (int) : значение длины второй пары сторон прямоугольника.

    Возращаемое значение :
        perimeter (int) : периметр квадрата со сторонами a и b.
    '''
    return (a + b) * 2
